mission07/basic/bbugguj/miniblog/app/views/communities/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."community_id" = ?  [["community_id", 1]]
---

<% @community.posts.reverse.each do |post| %>