mission07/basic/bbugguj/miniblog/app/controllers/communities_controller.rb

SELECT "communities".* FROM "communities" WHERE "communities"."id" = ? LIMIT 1  [["id", "2"]]
SELECT COUNT(*) FROM "roles" WHERE "roles"."user_id" = 1 AND "roles"."community_id" = 2
INSERT INTO "roles" ("access_type", "community_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["access_type", "member"], ["community_id", 2], ["created_at", Tue, 20 Aug 2013 15:11:16 UTC +00:00], ["updated_at", Tue, 20 Aug 2013 15:11:16 UTC +00:00], ["user_id", 1]]
---
  def join
    community = Community.find(params[:community_id])
    roles = Role.where :user => current_user, :community => community

    if roles.count == 0
      role = Role.create :user => current_user, :community => community

SELECT "communities".* FROM "communities"
---
  def index
    @communities = Community.all

INSERT INTO "communities" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 19 Aug 2013 13:39:52 UTC +00:00], ["updated_at", Mon, 19 Aug 2013 13:39:52 UTC +00:00]]
---
  def create
    @community = Community.new(community_params)

    respond_to do |format|
      if @community.save

SELECT "communities".* FROM "communities" WHERE "communities"."id" = ? ORDER BY "communities"."id" ASC LIMIT 1  [["id", 1]]
---
    def set_community
      @community = Community.find(params[:id])