mission07/basic/bbugguj/miniblog/app/controllers/posts_controller.rb

  def search
    @posts = Post.where("text like '%#{params[:search]}%'")
    @posts << Post.where("title like '%#{params[:search]}%'")
    @posts.flatten!.uniq!
    @communities = Community.all
---
SELECT "posts".* FROM "posts" WHERE (title like '%공지%')
SELECT "communities".* FROM "communities"

  def create
    @community = Community.find(params[:community_id])
    @post = @community.posts.new(post_params)
    @post.user = current_user

    if @post.save
---
SELECT "communities".* FROM "communities" WHERE "communities"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "posts" ("community_id", "created_at", "text", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["community_id", 1], ["created_at", Mon, 19 Aug 2013 14:48:14 UTC +00:00], ["text", "유저유저"], ["title", "유저"], ["updated_at", Mon, 19 Aug 2013 14:48:14 UTC +00:00], ["user_id", 1]]