mission07/basic/bbugguj/miniblog/app/controllers/welcome_controller.rb

  def index
  	@communities = Community.all
---
SELECT "communities".* FROM "communities"